String startlist = '''
Категория;Номер;Имя;Ник;Возраст;Команда;Город;Старт;Старт2
Девушки;2;Алексахина Варвара;Zoenor;35;ТимАк;Занаду;00:00:00;11:00:00
Девушки;7;Берестова Владислава;Marsica;41;ТимАк;Ктесифон;00:00:30;11:01:00
Девушки;14;Григолюк Изабелла;Isopy;31;РысакиТекс;Тикаль;00:01:00;11:02:00
Девушки;21;Игнатьева Розалия;Amsie;34;ТимАльянс;Ктесифон;00:01:30;11:03:00
Девушки;31;Костина Ангелина;Evecy;28;СтройРысаки;Тикаль;00:02:00;11:04:00
Девушки;33;Левицкая Инга;Emirah;30;;Фивы;00:02:30;11:05:00
Девушки;37;Лялюшкина Арина;Emloe;42;ТимАльянс;Занаду;00:03:00;11:06:00
Девушки;48;Рыбалкина Каролина;Frelda;25;;Занаду;00:03:30;11:07:00
Девушки;56;Сухиха Зоя;Lece;45;ГорРысаки;Занаду;00:04:00;11:08:00
Девушки;61;Урусова Евдокия;Ruber;23;;Карфаген;00:04:30;11:09:00
Любители;9;Гадолин Мечислав;Benlix;51;;Фивы;10:05:00;11:10:00
Любители;11;Голов Степан;Arter;55;;Ктесифон;10:05:30;11:11:00
Любители;16;Дуркин Наум;Ausott;28;;Тикаль;10:06:00;11:12:00
Любители;25;Каценеленбоген Ерофей;Jentian;43;;Занаду;10:06:30;11:13:00
Любители;26;Коваленко Артемий;Harbas;47;ТимДор;Багерхат;10:07:00;11:14:00
Любители;28;Коломийцев Никанор;Aarel;25;;Тикаль;10:07:30;11:15:00
Любители;34;Летов Измаил;Stantin;31;МигТим;Ктесифон;10:08:00;11:16:00
Любители;40;Миков Бронислав;Tedmed;22;;Тикаль;10:08:30;11:17:00
Любители;42;Нестеров Семен;Charcar;54;;Виджаянагар;10:09:00;11:18:00
Любители;54;Стариков Севастьян;Charfie;51;ГорРысаки;Карфаген;10:09:30;11:19:00
Любители;55;Стиплин Сергей;Leobas;21;ТимАльянс;Занаду;10:10:00;11:20:00
Любители;60;Удом Клавдий;Conhim;21;;Ктесифон;10:10:30;11:21:00
Любители;65;Хомичев Николай;Theoward;27;РусРысаки;Фивы;10:11:00;11:22:00
Любители;66;Чернобровин Иван;Edlie;25;ТимАк;Занаду;10:11:30;11:23:00
Любители;67;Чкалов Евсей;Cacas;30;;Багерхат;10:12:00;11:24:00
Любители;78;Ярославцев Олег;Stanrick;33;РысакиТекс;Фивы;10:12:30;11:25:00
Юниоры;6;Беляев Кирилл;Thorick;18;;Тикаль;10:13:00;11:26:00
Юниоры;15;Дубинин Лавр;Frekie;18;;Тикаль;10:13:30;11:27:00
Юниоры;17;Ельцов Валерьян;Stanter;16;РусРысаки;Багерхат;10:14:00;11:28:00
Юниоры;19;Жестакова Андрон;Fetin;21;;Виджаянагар;10:14:30;11:29:00
Юниоры;35;Луговой Феофан;Arler;16;;Карфаген;10:15:00;11:30:00
Юниоры;45;Решетилов Эммануил;Dalliam;17;;Тикаль;10:15:30;11:31:00
Юниоры;68;Шагубатов Вадим;Mohan;20;;Карфаген;10:16:00;11:32:00
Юниоры;72;Якин Самсон;Geornor;21;ТимАльянс;Багерхат;10:16:30;11:33:00
Юниоры;77;Яров Всеслав;Gablay;19;;Багерхат;10:17:00;11:34:00
Электро;3;Алифанов Самуил;Tothur;27;;Фивы;10:17:30;11:35:00
Электро;4;Баландин Игнат;Stanny;30;МигТим;Карфаген;10:18:00;11:36:00
Электро;8;Васильев Михей;Sonbert;32;ЮгТим;Фивы;10:18:30;11:37:00
Электро;18;Ельченко Касьян;Harricar;43;;Ктесифон;10:19:00;11:38:00
Электро;20;Ивкин Адам;Osvey;26;;Багерхат;10:19:30;11:39:00
Электро;22;Казаринов Ким;Luchie;42;МигТим;Ктесифон;10:20:00;11:40:00
Электро;24;Катков Тимофей;Tedfie;51;ТимДор;Карфаген;10:20:30;11:41:00
Электро;29;Кондраков Денис;Elison;23;;Ктесифон;10:21:00;11:42:00
Электро;41;Молчанов Валерий;Ronden;29;;Багерхат;10:21:30;11:43:00
Электро;47;Рубцов Вениамин;Wison;30;;Фивы;10:22:00;11:44:00
Электро;57;Терёшин Кирилл;Mover;21;;Виджаянагар;10:22:30;11:45:00
Электро;58;Турчанинов Харитон;Auscar;54;;Фивы;10:23:00;11:46:00
Электро;62;Уткин Демьян;Edand;51;;Багерхат;10:23:30;11:47:00
Мастера;64;Форофонтов Сократ;Milan;29;РысакиТекс;Занаду;10:24:00;11:48:00
Мастера;70;Штыков Никифор;Reume;35;ГорРысаки;Виджаянагар;10:24:30;11:49:00
Мастера;75;Якшин Мирон;Thoben;39;ЮгТим;Тикаль;10:25:00;11:50:00
Мастера;76;Яржемковский Марк;Wigan;29;;Ктесифон;10:25:30;11:51:00
Мастера;79;Яценковский Виссарион;Charham;43;;Фивы;10:26:00;11:52:00
Мастера;10;Глоба Викентий;Reulay;29;ТимАк;Виджаянагар;10:26:30;11:53:00
Мастера;30;Корепанов Никифор;Freel;50;;Фивы;10:27:00;11:54:00
Мастера;32;Лагошин Фадей;Tothur;50;;Карфаген;10:27:30;11:55:00
Мастера;39;Медведев Емельян;Lini;48;;Тикаль;10:28:00;11:56:00
Мастера;51;Симонов Григорий;Gabmes;26;;Занаду;10:28:30;11:57:00
Мастера;52;Смелоч Антон;Milix;52;ТимДор;Багерхат;10:29:00;11:58:00
Мастера;63;Фламин Матвей;Arham;54;ЮгТим;Виджаянагар;10:29:30;11:59:00
Мастера;74;Якушев Дементий;Rovey;40;ТимДор;Виджаянагар;10:30:00;12:00:00
Элита;1;Абушаев Лев;Cade;21;НикоРысаки;Ктесифон;10:30:30;12:01:00
Элита;5;Баренцев Святослав;Cales;48;;Виджаянагар;10:31:00;12:02:00
Элита;12;Горяинов Поликарп;Rohim;55;НикоРысаки;Тикаль;10:31:30;12:03:00
Элита;13;Графов Модест;Fincob;29;;Фивы;10:32:00;12:04:00
Элита;23;Кайпанов Зиновий;Harrilliam;44;;Багерхат;10:32:30;12:05:00
Элита;27;Ковпак Владлен;Matver;27;;Виджаянагар;10:33:00;12:06:00
Элита;36;Луньков Лаврентий;Lukelix;54;;Карфаген;10:33:30;12:07:00
Элита;38;Мамин Радислав;Isaacvid;55;;Занаду;10:34:00;12:08:00
Элита;43;Песков Пимен;Samy;53;МигТим;Тикаль;10:34:30;12:09:00
Элита;44;Потапов Лукьян;Feja;48;СтройРысаки;Карфаген;10:35:00;12:10:00
Элита;46;Родин Изяслав;Lewlie;27;;Ктесифон;10:35:30;12:11:00
Элита;49;Ряполов Марк;Dymy;23;;Карфаген;10:36:00;12:12:00
Элита;50;Сафронов Кир;Finlie;25;;Виджаянагар;10:36:30;12:13:00
Элита;53;Стаин Максимильян;Theoden;54;РусРысаки;Виджаянагар;10:37:00;12:14:00
Элита;59;Угольников Елисей;Witian;44;СтройРысаки;Занаду;10:37:30;12:15:00
Элита;69;Шилов Мирон;Aaran;23;ЮгТим;Багерхат;10:38:00;12:16:00
Элита;71;Эмин Евграф;Fredcha;33;НикоРысаки;Ктесифон;10:38:30;12:17:00
Элита;73;Яковлев Филипп;Ronthan;49;;Карфаген;10:39:00;12:18:00''';

String startlistWithErrors = '''
Категория;Номер;Имя;Ник;Возраст;Команда;Город;Старт;Старт2
Девушки;2;Алексахина Варвара;Zoenor;35;ТимАк;Занаду;10:00:00;11:00:00
Девушки;7;Берестова Владислава;Marsica;41;ТимАк;Ктесифон;10:00:30;11:01:00
Девушки;14;Григолюк Изабелла;Isopy;31;РысакиТекс;Тикаль;10:01:00;11:02:00
Девушки;21;Игнатьева Розалия;Amsie;34;ТимАльянс;Ктесифон;10:01:30;11:03:00
Девушки;31;Костина Ангелина;Evecy;28;СтройРысаки;Тикаль;10:02:00;11:04:00
Девушки;33;Левицкая Инга;Emirah;30;;Фивы;10:02:30;11:05:00
Девушки;37;Лялюшкина Арина;Emloe;42;ТимАльянс;Занаду;10:03:00;11:06:00
Девушки;48;Рыбалкина Каролина;Frelda;25;;Занаду;10:03:30;11:07:00
Девушки;56;Сухиха Зоя;Lece;45;ГорРысаки;Занаду;10:04:00;11:08:00
Девушки;61;Урусова Евдокия;Ruber;23;;Карфаген;10:04:30;11:09:00
Любители;9;Гадолин Мечислав;Benlix;51;;Фивы;10:05:00;11:10:00
Любители;11;Голов Степан;Arter;55;;Ктесифон;10:05:30;11:11:00
Любители;16;Дуркин Наум;Ausott;28;;Тикаль;10:06:00;11:12:00
Любители;25;Каценеленбоген Ерофей;Jentian;43;;Занаду;10:06:30;11:13:00
Любители;26;Коваленко Артемий;Harbas;47;ТимДор;Багерхат;10:07:00;11:14:00
Любители;28;Коломийцев Никанор;Aarel;25;;Тикаль;10:07:30;11:15:00
Любители;34;Летов Измаил;Stantin;31;МигТим;Ктесифон;10:08:00;11:16:00
Любители;40;Миков Бронислав;Tedmed;22;;Тикаль;10:08:30;11:17:00
Любители;42;Нестеров Семен;Charcar;54;;Виджаянагар;10:09:00;11:18:00
Любители;54;Стариков Севастьян;Charfie;51;ГорРысаки;Карфаген;10:09:30;11:19:00
Любители;55;Стиплин Сергей;Leobas;21;ТимАльянс;Занаду;10:10:00;11:20:00
Любители;60;Удом Клавдий;Conhim;21;;Ктесифон;10:10:30;11:21:00
Любители;65;Хомичев Николай;Theoward;27;РусРысаки;Фивы;10:11:00;11:22:00
Любители;66;Чернобровин Иван;Edlie;25;ТимАк;Занаду;10:11:30;11:23:00
Любители;67;Чкалов Евсей;Cacas;30;;Багерхат;10:12:00;11:24:00
Любители;78;Ярославцев Олег;Stanrick;33;РысакиТекс;Фивы;10:12:30;11:25:00
Юниоры;6;Беляев Кирилл;Thorick;18;;Тикаль;10:13:00;11:26:00
Юниоры;15;Дубинин Лавр;Frekie;18;;Тикаль;10:13:30;11:27:00
Юниоры;17;Ельцов Валерьян;Stanter;16;РусРысаки;Багерхат;10:14:00;11:28:00
Юниоры;19;Жестакова Андрон;Fetin;21;;Виджаянагар;10:14:30;11:29:00
Юниоры;35;Луговой Феофан;Arler;16;;Карфаген;10:15:00;11:30:00
Юниоры;45;Решетилов Эммануил;Dalliam;17;;Тикаль;10:15:30;11:31:00
Юниоры;68;Шагубатов Вадим;Mohan;20;;Карфаген;10:16:00;11:32:00
Юниоры;72;Якин Самсон;Geornor;21;ТимАльянс;Багерхат;10:16:30;11:33:00
Юниоры;77;Яров Всеслав;Gablay;19;;Багерхат;10:17:00;11:34:00
Электро;З;Алифанов Самуил;Tothur;27;;Фивы;10:17:30;11:35:00
Электро;4;Баландин Игнат;Stanny;30;МигТим;Карфаген;10:18:00;11:36:00
Электро;8;Васильев Михей;Sonbert;32;ЮгТим;Фивы;10:18:30;11:37:00
Электро;18;Ельченко Касьян;Harricar;43;;Ктесифон;10:19:00;11:38:00
Электро;20;Ивкин Адам;Osvey;26;;Багерхат;10:19:30;11:39:00
Электро;22;Казаринов Ким;Luchie;42;МигТим;Ктесифон;10:20:00;11:40:00
Электро;24;Катков Тимофей;Tedfie;51;ТимДор;Карфаген;10:20:30;11:41:00
Электро;29;Кондраков Денис;Elison;23;;Ктесифон;10:21:00;11:42:00
Электро;41;Молчанов Валерий;Ronden;29;;Багерхат;10:21:30;11:43:00
Электро;47;Рубцов Вениамин;Wison;30;;Фивы;10:22:00;11:44:00
Электро;57;Терёшин Кирилл;Mover;21;;Виджаянагар;10:22:30;11:45:00
Электро;58;Турчанинов Харитон;Auscar;54;;Фивы;10:23:00;11:46:00
Электро;62;Уткин Демьян;Edand;51;;Багерхат;10:23:30;11:47:00
Мастера;64;Форофонтов Сократ;Milan;29;РысакиТекс;Занаду;10:24:00;11:48:00
Мастера;70;Штыков Никифор;Reume;35;ГорРысаки;Виджаянагар;10:24:30;11:49:00
Мастера;75;Якшин Мирон;Thoben;39;ЮгТим;Тикаль;10:25:00;11:50:00
Мастера;76;Яржемковский Марк;Wigan;29;;Ктесифон;10:25:30;11:51:00
Мастера;79;Яценковский Виссарион;Charham;43;;Фивы;10:26:00;11:52:00
Мастера;10;Глоба Викентий;Reulay;29;ТимАк;Виджаянагар;10:26:30;11:53:00
Мастера;30;Корепанов Никифор;Freel;50;;Фивы;10:27:00;11:54:00
Мастера;32;Лагошин Фадей;Tothur;50;;Карфаген;10:27:30;11:55:00
Мастера;39;Медведев Емельян;Lini;48;;Тикаль;10:28:00;11:56:00
Мастера;51;Симонов Григорий;Gabmes;26;;Занаду;10:28:30;11:57:00
Мастера;52;Смелоч Антон;Milix;52;ТимДор;Багерхат;10:29:00;11:58:00
Мастера;63;Фламин Матвей;Arham;54;ЮгТим;Виджаянагар;10:29:30;11:59:00
Мастера;74;Якушев Дементий;Rovey;40;ТимДор;Виджаянагар;10:30:00;12:00:00
Элита;1;Абушаев Лев;Cade;21;НикоРысаки;Ктесифон;10:30:30;12:01:00
Элита;5;Баренцев Святослав;Cales;48;;Виджаянагар;10:31:00;12:02:00
Элита;12;Горяинов Поликарп;Rohim;55;НикоРысаки;Тикаль;10:31:30;12:03:00
Элита;13;Графов Модест;Fincob;29;;Фивы;10:32:00;12:04:00
Элита;23;Кайпанов Зиновий;Harrilliam;44;;Багерхат;10:32:30;12:05:00
Элита;27;Ковпак Владлен;Matver;27;;Виджаянагар;10:33:00;12:06:00
Элита;36;Луньков Лаврентий;Lukelix;54;;Карфаген;10:33:30;12:07:00
Элита;38;Мамин Радислав;Isaacvid;55;;Занаду;10:34:00;12:08:00
Элита;43;Песков Пимен;Samy;53;МигТим;Тикаль;10:34:30;12:09:00
Элита;44;Потапов Лукьян;Feja;48;СтройРысаки;Карфаген;10:35:00;12:10:00
Элита;46;Родин Изяслав;Lewlie;27;;Ктесифон;10:35:30;12:11:00
Элита;49;Ряполов Марк;Dymy;23;;Карфаген;10:36:00;12:12:00
Элита;50;Сафронов Кир;Finlie;25;;Виджаянагар;10:36:30;12:13:00
Элита;53;Стаин Максимильян;Theoden;54;РусРысаки;Виджаянагар;10:37:00;12:14:00
Элита;59;Угольников Елисей;Witian;44;СтройРысаки;Занаду;10:37:30;12:15:00
Элита;69;Шилов Мирон;Aaran;23;ЮгТим;Багерхат;10:38:00;12:16:00
Элита;71;Эмин Евграф;Fredcha;33;НикоРысаки;Ктесифон;10:38:30;12:17:00
Элита;73;Яковлев Филипп;Ronthan;49;;Карфаген;10:39:00;12:18:00''';


String stageslist = '''
Номер;СУ 1;СУ 2;СУ 3;СУ 4
1;10:00:00;11:00:00;12:00:00;13:00:00
2;10:01:00;11:01:00;12:01:00;13:01:00
3;10:02:00;11:02:00;12:02:00;13:02:00
4;10:03:00;11:03:00;12:03:00;13:03:00
5;10:04:00;11:04:00;12:04:00;13:04:00
6;10:05:00;11:05:00;12:05:00;13:05:00
7;10:06:00;11:06:00;12:06:00;13:06:00
8;10:07:00;11:07:00;12:07:00;13:07:00
9;10:08:00;11:08:00;12:08:00;13:08:00
10;10:09:00;11:09:00;12:09:00;13:09:00
11;10:10:00;11:10:00;12:10:00;13:10:00
12;10:11:00;11:11:00;12:11:00;13:11:00
13;10:12:00;11:12:00;12:12:00;13:12:00
14;10:13:00;11:13:00;12:13:00;13:13:00
15;10:14:00;11:14:00;12:14:00;13:14:00
16;10:15:00;11:15:00;12:15:00;13:15:00
17;10:16:00;11:16:00;12:16:00;13:16:00
18;10:17:00;11:17:00;12:17:00;13:17:00
''';

String stageslistWithErrors = '''
Номер;СУ 1;СУ 2;СУ 3;СУ 4
1;10:00:00;11:00:00;12:00:00;13:00:00
2;10:01:00;11:01:00;12:01:00;13:01:00
3;10:02:00;11:02:00;12:02:00;13:02:00
4;10:03:00;11:03:00;12:03:00;13:03:00
5;10:04:00;11:04:00;12:04:00;13:04:00
6;10:05:00;11:05:00;12:05:00;13:05:00
a;10:06:00;11:06:00;12:06:00;13:06:00
8;10:07:00;11:07:00;12:07:00;13:07:00
9;10:08:00;11:08:00;12:08:00;13:08:00
10;10:09:00;11:09:00;12:09:00;13:09:00
11;10:10:00;11:10:00;12:10:00;13:10:00
12;10:11:00;11:11:00;12:11:00;13:11:00
13;10:12:00;11:12:00;12:12:00;13:12:00
14;10:13:00;11:13:00;12:13:00;13:13:00
15;10:14:00;11:14:00;12:14:00;13:14:00
16;10:15:00;11:15:00;12:15:00;13:15:00
17;10:16:00;11:16:00;12:16:00;13:16:00
18;10:17:00;11:17:00;12:17:00;13:17:00
''';
